---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageKey.IsEqual(Autodesk.Revit.DB.FailureMessageKey)
source: html/c022ee7f-ac8a-c7d1-83b8-2cd1ff062c47.htm
---
# Autodesk.Revit.DB.FailureMessageKey.IsEqual Method

Checks it this key is equal to the other.

## Syntax (C#)
```csharp
public bool IsEqual(
	FailureMessageKey other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.FailureMessageKey`) - The key to compare with.

## Returns
True if keys are equal, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null